cf/Catalogs/обм_ОбменДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>обм_ОбменДанными</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасписаниеВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимумОбъектовВПакете</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьВБуфере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Настройки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоответствияПутей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьТут</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьТам</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/InformationRegisters/обм_Буфер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>обм_Буфер</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерПовтораПриОшибке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Обмен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.обм_ОбменДанными</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Набор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.обм_НаборыДанных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Catalogs/обм_ОбменДанными/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМенеджерОбъектов(Команда)
	
	ОткрытьФорму("Справочник.обм_ОбменДанными.Форма.МенеджерОбъектовБазы");
	
КонецПроцедуры
&НаКлиенте
Процедура БуферОбмена(Команда)
	
	ОткрытьФорму("РегистрСведений.обм_Буфер.ФормаСписка");
	
КонецПроцедуры
&НаКлиенте
Процедура Логи(Команда)
	
	ОткрытьФорму("РегистрСведений.обм_ЛогЗапросов.ФормаСписка");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Элементы.ГруппаУправления.Видимость = Ложь; 
		// Получим расписание из регл задания
		
		Объект.РасписаниеВыгрузки = РасписаниеВСтроку(ПолучитьРасписание());
		
	Иначе
		ВидимостьРоботов(); КонецЕсли;
	
КонецПроцедуры

#Область РоботоТехника

&НаСервере
Функция ПолучитьКлючПоискаРоботов()
	
	Возврат Новый Структура("Ключ, Метаданные, Использование", XMLСтрока(Объект.Ссылка), "обм_Обмен", Истина);
	
КонецФункции

&НаСервере
Функция ЗапуститьРобота()
	
	Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание("обм_Обмен");
	
	текПараметры = Новый Массив;
	текПараметры.Добавить(Объект.Ссылка);
	
	Задание.Использование 	= Истина;
	Задание.Параметры 		= текПараметры;
	Задание.Ключ 			= XMLСтрока(Объект.Ссылка);
	Задание.Наименование 	= "[Обмен] Выгрузка данных (" + Объект.Наименование + ")";
			
	Задание.Расписание 		= ПолучитьРасписание();
		
	Попытка 	Задание.Записать(); 
	Исключение 	Сообщить("Ошибка записи задания " + ОписаниеОшибки());
				Возврат Ложь; КонецПопытки;
			
	ВидимостьРоботов();
	Возврат Истина;
	
КонецФункции
&НаСервере
Функция УдалитьРоботов()
	
	Задания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(ПолучитьКлючПоискаРоботов());
	Для Каждого Задание Из Задания Цикл
		
		Попытка 	Задание.Удалить();
		Исключение	Сообщить("Ошибка при удалении автоматической выгрузки " + ОписаниеОшибки());
					Возврат Ложь; КонецПопытки;	КонецЦикла;
			
	ВидимостьРоботов();
	Возврат Истина;
	
КонецФункции
&НаСервере
Функция ОбновитьРасписаниеРоботов()
	
	Задания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(ПолучитьКлючПоискаРоботов());
	Для Каждого Задание Из Задания Цикл
		
		Задание.Расписание = ПолучитьРасписание();
		
		Попытка 	Задание.Записать(); 
		Исключение 	Сообщить("Ошибка обновления задания " + ОписаниеОшибки());
					Возврат Ложь; КонецПопытки; КонецЦикла;
			
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ВидимостьРоботов()
	
	ЕстьЗадание = РегламентныеЗадания.ПолучитьРегламентныеЗадания(ПолучитьКлючПоискаРоботов()).Количество();
	Элементы.ГруппаАктивировать.Видимость 	= Не ЕстьЗадание;
	Элементы.ГруппаДеАктивировать.Видимость = ЕстьЗадание;
	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьВыгрузку(Команда)
	
	Если ЗапуститьРобота() Тогда
		ПоказатьОповещениеПользователя("Автоматическая выгрузка запущена",,"Запущена и активирована согласно расписанию", БиблиотекаКартинок.РегламентноеЗадание); КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ВыключитьОбмен(Команда)
	
	УдалитьРоботов();
	
КонецПроцедуры

&НаСервере
Функция РасписаниеВСтроку(Расписание)
	
	Возврат ЗначениеВСтрокуВнутр(Расписание);
	
КонецФункции
&НаСервере
Функция ПолучитьРасписание()
	
	Попытка	Расписание = ЗначениеИзСтрокиВнутр(Объект.РасписаниеВыгрузки);
	Исключение КонецПопытки;
	
	Если ТипЗнч(Расписание) <> Тип("РасписаниеРегламентногоЗадания") Тогда
		НовЗадание = РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные.РегламентныеЗадания.обм_Обмен);
		Возврат НовЗадание.Расписание; 
	Иначе
		Возврат Расписание; КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура УстановленоРасписаниеПользователем(Расписание, ДополнительныеПараметры) Экспорт
	
	Если Расписание <> Неопределено Тогда
		
		Объект.РасписаниеВыгрузки = РасписаниеВСтроку(Расписание);
		
		Если ОбновитьРасписаниеРоботов() Тогда
			Модифицированность = Истина;
			ПоказатьОповещениеПользователя("Расписание обновлено",,, БиблиотекаКартинок.РегламентноеЗадание); КонецЕсли; КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура Декорация3Нажатие(Элемент)
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(ПолучитьРасписание());
	Диалог.Показать(Новый ОписаниеОповещения("УстановленоРасписаниеПользователем", ЭтаФорма));
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьСейчасНаСервере()
	
	обм_Обмен.обм_Обмен(Объект.Ссылка);
	
КонецПроцедуры
&НаКлиенте
Процедура ВыгрузитьСейчас(Команда)
	
	ПоказатьОповещениеПользователя("Отправлена команада на сервер",,"Выгрузить объекты накопденные в буфере");
	ВыгрузитьСейчасНаСервере();
	
КонецПроцедуры

#КонецОбласти
